{
  "backend/main.mo": "Empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Report describing a feature update for 2:3 aspect ratio image cards and listing related files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference.",
  "frontend/index.css": "Tailwind base setup defining extensive CSS variables for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "HTML entry point loading the main React app into the root div.",
  "frontend/src/App.tsx": "Root React component managing password unlocking, entry gating, audio state, and rendering all main content sections.",
  "frontend/src/components/AmbientBackground.tsx": "Canvas animation component rendering floating emoji particles across the screen.",
  "frontend/src/components/BackgroundAudio.tsx": "Background audio controller with play/pause and mute buttons using an HTMLAudioElement.",
  "frontend/src/components/BirthdayMessagePopup.tsx": "Dialog popup containing the birthday message with animated hearts and sparkles.",
  "frontend/src/components/EmojiHeader.tsx": "Sticky animated emoji header cycling through a list of emojis.",
  "frontend/src/components/EntryOverlay.tsx": "Full‑screen entry overlay with animated hearts and a button to enter the site.",
  "frontend/src/components/HeroSection.tsx": "Hero section with animated background and multiple romantic text blocks.",
  "frontend/src/components/LoveLetterModal.tsx": "Scrollable modal showing the full love letter using dialog and scroll-area components.",
  "frontend/src/components/memories/ImageMemoryCard.tsx": "A flip-style image memory card allowing uploads, framing adjustments, and card flipping for messages.",
  "frontend/src/components/memories/ImageMemorySection.tsx": "Manages a list of image memory cards with local storage persistence and the ability to add or update memories.",
  "frontend/src/components/memories/VideoMemorySection.tsx": "Displays a grid of video memory tiles loaded from local storage, allowing users to upload or replace videos.",
  "frontend/src/components/memories/VideoMemoryTile.tsx": "A video tile component that supports uploading or replacing a video and displays it with basic controls.",
  "frontend/src/components/PasswordGate.tsx": "A password-protected gate component that validates input and unlocks content with animated decorative UI.",
  "frontend/src/components/SurpriseSection.tsx": "Displays a surprise section with a modal love letter, birthday message, and styled romantic UI elements.",
  "frontend/src/content/loveLetter.ts": "Exports a multi‑paragraph love letter string used in the surprise section modal.",
  "frontend/src/content/romanticMessages.ts": "Exports an array of short romantic messages used for image memory cards.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are used.",
  "frontend/src/index.css": "Defines global Tailwind-based styling, theme variables, dark mode settings, and custom component/animation utilities.",
  "frontend/src/lib/localMemoryStore.ts": "Manages loading and saving image and video memory data to localStorage with simple interfaces.",
  "frontend/src/lib/sessionFlags.ts": "Handles sessionStorage flags for tracking unlocked and entered state in the app.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, plugins, and extended utilities for the app's design system.",
  "project_state.json": "Contains high-level project metadata, features, requirements, and architectural notes for the birthday site."
}