{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report placeholder with no features.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend source files.",
  "frontend/index.css": "Tailwind base/theme setup defining light and dark OKLCH color variables and global styles.",
  "frontend/index.html": "Root HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app orchestrating password gate, entry flow, background audio, and all content sections.",
  "frontend/src/components/AmbientBackground.tsx": "Canvas-based floating emoji particle animation rendered behind all content.",
  "frontend/src/components/BackgroundAudio.tsx": "Audio controller for looping background music with play and mute toggles.",
  "frontend/src/components/BirthdayMessagePopup.tsx": "Dialog popup showing a styled birthday message with floating heart and sparkle effects.",
  "frontend/src/components/EmojiHeader.tsx": "Sticky animated emoji header cycling through icons.",
  "frontend/src/components/EntryOverlay.tsx": "Full-screen animated intro overlay prompting the user to enter the site.",
  "frontend/src/components/HeroSection.tsx": "Hero section with background image, gradients, and birthday text blocks.",
  "frontend/src/components/LoveLetterModal.tsx": "Modal that displays a love letter with a typing animation and reduced‑motion support.",
  "frontend/src/components/memories/ImageMemoryCard.tsx": "Flippable memory card that lets users upload and validate JPG images and shows an associated message.",
  "frontend/src/components/memories/ImageMemorySection.tsx": "Loads, displays, and manages a list of image memory cards with persistent storage.",
  "frontend/src/components/memories/VideoMemorySection.tsx": "Loads and displays a grid of video memory tiles, initializing defaults and saving updates.",
  "frontend/src/components/memories/VideoMemoryTile.tsx": "Tile allowing upload and validation of MP4 or MP3 media and displaying the chosen file.",
  "frontend/src/components/PasswordGate.tsx": "Password entry screen that unlocks content after validating a hardcoded password.",
  "frontend/src/components/SurpriseSection.tsx": "Section with a button to open the love‑letter modal and additional birthday messages.",
  "frontend/src/content/loveLetter.ts": "Exports the full love letter text used in the modal.",
  "frontend/src/content/romanticMessages.ts": "Exports an array of romantic messages used in memory cards.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, identity loading, and status management via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend query methods exist.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, glass and 3D card components, and animation utilities for the UI.",
  "frontend/src/lib/localMemoryStore.ts": "Handles loading and saving image and video memory objects to localStorage with simple JSON persistence.",
  "frontend/src/lib/sessionFlags.ts": "Manages session-scoped flags for unlocked and entered state using sessionStorage.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, plugins, and content paths including custom soft-pink and rose-gold palettes.",
  "project_state.json": "Tracks project metadata, feature set, architecture notes, and requirements for the romantic birthday website."
}